wangben85/nRF52832_SDK_16.0_Ben/examples/ble_peripheral/ble_app_uart_hs/nus_slave_throughput_notification.c
buffer_t m_buf;
void ble_data_send_with_queue(void)
{
	uint32_t err_code;
	uint16_t length = 0;
	static bool retry = false;
	
	if (retry)
	{
		length = m_buf.length;//previously data which is not sent successfully, need to send again
		err_code = ble_nus_data_send(&m_nus, m_buf.p_data, &length, m_conn_handle);
		//NRF_LOG_INFO("Data2: %d", m_buf.p_data[0]);
		if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
				 (err_code != NRF_ERROR_NOT_FOUND) )
		{
				APP_ERROR_CHECK(err_code);
		}
		if (err_code == NRF_SUCCESS)
		{
			m_len_sent += length;
			retry = false;
		}
	}
	
	while (!nrf_queue_is_empty(&m_buf_queue) && !retry)
	{		

		err_code = nrf_queue_pop(&m_buf_queue, &m_buf);//pop data from queue
		APP_ERROR_CHECK(err_code);		
		length = m_buf.length;//data length from queue
					
		err_code = ble_nus_data_send(&m_nus, m_buf.p_data, &length, m_conn_handle);
		//NRF_LOG_INFO("Data: %d", m_buf.p_data[0]);
		if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
				 (err_code != NRF_ERROR_NOT_FOUND) )
		{
				APP_ERROR_CHECK(err_code);
		}
		if (err_code == NRF_SUCCESS)
		{
			m_len_sent += length;
			retry = false;
		}
		else
		{
			retry = true;
			break;
		}
	}			
}

//timeout every 7ms , send m_data_array data
static void throughput_timer_handler(void * p_context)
{
#ifndef APP_QUEUE	
	//the snippet used to test data throughput only. no queue is involved
	ret_code_t err_code;
	uint16_t length;
	m_cnt_7ms++;	
	//sending code lines
	length = m_ble_nus_max_data_len;	
	do
	{					
		err_code = ble_nus_data_send(&m_nus, m_data_array, &length, m_conn_handle);//actual data array send size: m_data_array[247-3]
		if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
				 (err_code != NRF_ERROR_NOT_FOUND) )
		{
				APP_ERROR_CHECK(err_code);
		}
		if (err_code == NRF_SUCCESS)
		{
			m_len_sent += length; 	
			m_data_array[0]++;
			m_data_array[length-1]++;	
		}
	} while (err_code == NRF_SUCCESS);

	//calculate speed every 1 second, used as the timer
	if (m_cnt_7ms == 143)
	{
		NRF_LOG_INFO("==**Speed: %d B/s**==", m_len_sent);
		m_cnt_7ms = 0;
		m_len_sent = 0;
		m_data_array[0] = 0;
		m_data_array[length-1] = 0;
	}	
	//NRF_LOG_INFO("PacketNo.: %d == Time: %d *7ms", m_data_array[0], m_cnt_7ms);	
#else
	//the snippet simulate a real application scenairo. Queue is involved.
	ret_code_t err_code1, err_code2;	
	buffer_t buf;
	static uint8_t val = 0;
	//produce the data irregard of BLE activity
	m_data_array[(m_cnt_7ms%10)*420] = val++;
	m_data_array[(m_cnt_7ms%10)*420+210] = val++;
	
	//put the data into a queue to cache them
	buf.p_data = &m_data_array[(m_cnt_7ms%10)*420];
	buf.length = MIN(m_ble_nus_max_data_len,210);
	err_code1 = nrf_queue_push(&m_buf_queue, &buf);
	//APP_ERROR_CHECK(err_code1); //it may return NRF_ERROR_NO_MEM. we skip this error
	
	buf.p_data = &m_data_array[(m_cnt_7ms%10)*420+210];
	buf.length = MIN(m_ble_nus_max_data_len,210);
	err_code2 = nrf_queue_push(&m_buf_queue, &buf);
	//APP_ERROR_CHECK(err_code2);	//it may return NRF_ERROR_NO_MEM. we skip this error
	
	ble_data_send_with_queue();
	
	if(err_code1 == NRF_ERROR_NO_MEM || err_code2 == NRF_ERROR_NO_MEM)
	{
		NRF_LOG_INFO("Drop");	
	}
	
	m_cnt_7ms++;	
	//calculate speed every 1 second
	if (m_cnt_7ms == 143)
	{
		NRF_LOG_INFO("==**Speed: %d B/s**==", m_len_sent);
		m_cnt_7ms = 0;
		m_len_sent = 0;
	}	
	//NRF_LOG_INFO("Time: %d *7ms", m_cnt_7ms);		
	
#endif	
}


void throughput_test()
{
	ret_code_t err_code;
	err_code = app_timer_create(&m_timer_speed, APP_TIMER_MODE_REPEATED, throughput_timer_handler);
   //app_timer_start(m_timer_speed, APP_TIMER_TICKS(7),NULL) when notification is enabled, 7ms timeout
	APP_ERROR_CHECK(err_code);

//Connection length ext enable
#if 1
	  ble_opt_t  opt;
    memset(&opt, 0x00, sizeof(opt));
    opt.common_opt.conn_evt_ext.enable = true;
    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);
#endif	
	
}

/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
//    for(int i = 0; i < 6300; i++)
//    {
//       m_data_array[i] = i;
//    }
    
    uart_init();
    log_init(); //default LOG is enabled and RTT is used
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();
	
	 throughput_test();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
